# LinePattern Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinePattern Methods
LinePattern Class See Also
---
The LinePattern type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSegments | Gets the sequence of segments that defines this line pattern. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetSegments | Sets the sequence of segments that defines this line pattern. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
LinePattern Class
Autodesk.Revit.DB Namespace